org/index.org
#+STARTUP: showall
#+OPTIONS: toc:nil num:nil
#+BEGIN_EXPORT html
---
layout: default
title: Matthew Rothlisberger
---
#+END_EXPORT

I am an electrical engineering student and software developer. I often
go by the handle *asterane* on the internet. Welcome to my homepage!

* Recent Posts
#+BEGIN_EXPORT html
<ul class="posts">
{% for post in site.posts limit: 5 %}
  <div class="post_info">
    <li>
	    <a href="{{ post.url }}">{{ post.title }}</a>
	    <span>({{ post.date | date:"%Y-%m-%d" }})</span>
    </li>
    <p>{{ post.excerpt }}</p>
    </div>
  {% endfor %}
</ul>
#+END_EXPORT

* Overview
Navigate the site using the links to the left (or above, on
mobile).

[[file:about.org][About]] gives more information about me, my work, and my education.

Under [[file:projects.org][Projects]], find information about my engineering projects, each
of which has its own GitHub repository.

My [[file:blog.org][blog]] contains writings on technology and engineering, hardware and
software alike.

In the footer are links to my [[https://github.com/asterane][GitHub]] profile, my [[file:contact.org][contact]] page, and the
[[file:colophon.org][colophon]] for this site.
